Repository: 123andy/PimpMyLog
Catalog: lang/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: No log has been found.
fr_fr: Aucun log n'a été trouvé.

source: Notifications are denied for this site. Go to your browser preferences to enable notifications for this site.
fr_fr: Les notifications de bureau sont interdites pour cet site. Activez les dans les préférences de votre navigateur.

source: Your profile has been successfully saved!
fr_fr: Votre profil a bien été enregistré !

source: Confirm
fr_fr: Confirmer

source: Search was done with regular engine
fr_fr: Recherche régulière effectuée

source: Search was done with RegEx engine
fr_fr: Recherche effectuée avec Expression Regulière

source: Result copied!
fr_fr: Résultat copié !

source: Roles
fr_fr: Rôles

source: No log has been found with Reg Ex search %s
fr_fr: Aucun log n'a été trouvé avec la recherche de type Expression Regulière %s

source: No log has been found with regular search %s
fr_fr: Aucun log n'a été trouvé avec la recherche régulière %s

source: Sign in
fr_fr: Connexion

source: Sign in as
fr_fr: Connexion en tant que

source: Sign in error
fr_fr: Erreur de connexion

source: System
fr_fr: Système

source: Toggle column %s
fr_fr: Montrer/Cacher la colonne %s

source: URL copied!
fr_fr: Adresse copiée !

source: User
fr_fr: Utilisateur

source: User has been successfully saved!
fr_fr: L'utilisateur a bien été enregistré !

source: Last API call
fr_fr: Dernier appel API

source: API calls
fr_fr: Appels API

source: User has been successfully deleted!
fr_fr: L'utilisateur a bien été supprimé !

source: Log access
fr_fr: Accès aux logs

source: User name
fr_fr: Nom d'utilisateur

source: Users
fr_fr: Utilisateurs

source: You need to sign in
fr_fr: Vous devez vous connecter

source: Reload the page with default parameters
fr_fr: Recharger la page avec les paramètres par défaut

source: Click to refresh or press the R key
fr_fr: Cliquez pour rafraichir ou appuyez sur la touche R

source: Select a log file to display
fr_fr: Sélectionnez un fichier de log à afficher

source: Log file #%s defined in %s
fr_fr: Fichier de log #%s défini dans %s

source: Log file #%s defined in main configuration file
fr_fr: Fichier de log #%s défini dans le fichier de configuration principal

source: Search in logs
fr_fr: Recherche

source: Select a duration to check for new logs automatically
fr_fr: Sélectionner une durée pour chercher de nouveaux logs automatiquement

source: No refresh
fr_fr: Pas de rechargement

source: Refresh %ss
fr_fr: Recharge %ss

source: Max count of logs to display
fr_fr: Nombre maximal de lignes à afficher

source: Desktop notifications on supported modern browsers
fr_fr: Notifications de bureau pour les navigateurs récents

source: Displayed columns
fr_fr: Colonnes affichées

source: Settings
fr_fr: Paramètres

source: Wide view
fr_fr: Vue élargie

source: on
fr_fr: oui

source: off
fr_fr: non

source: Click on a date field to mark a row
fr_fr: Cliquer sur une date pour marquer une ligne

source: Clear markers
fr_fr: Effacer les marqueurs

source: Language
fr_fr: Langue

source: Change language...
fr_fr: Choisir une langue

source: Language cannot be changed
fr_fr: La langue ne peut pas être changée

source: Timezone
fr_fr: Fuseau horaire

source: Change timezone...
fr_fr: Changer fuseau horaire

source: You are currently connected as %s
fr_fr: Vous êtes actuellement connecté en tant que %s

source: User settings
fr_fr: Paramètres utilisateur

source: Click here to manager users
fr_fr: Cliquez ici pour gérer les utilisateurs

source: Manage users
fr_fr: Gérer les utilisateurs

source: Click here to view your profile
fr_fr: Cliquez ici pour voir votre profil

source: Profile
fr_fr: Profil

source: Click here to change your password
fr_fr: Cliquez ici pour changer votre mot de passe

source: Change password
fr_fr: Mot de passe

source: Click here to sign out
fr_fr: Cliquez ici pour vous déconnecter

source: Welcome in version %s
fr_fr: Bienvenue en version %s

source: The changelog and all informations about this version are available on the %sblog%s.
fr_fr: Toutes les informations à propos de cette version sont disponibles sur le %sblog%s.

source: No more data
fr_fr: Pas plus de données

source: Load more
fr_fr: Plus de logs

source: Export
fr_fr: Exporter

source: JSONP (with callback)
fr_fr: JSONP (avec callback)

source: JSON Pretty Print
fr_fr: JSON Affichage humain

source: Close
fr_fr: Fermer

source: Webservice URL
fr_fr: Adresse web service

source: Your URL seems to be local so it won't be reachable by external browsers and services
fr_fr: L'URL semble être une adresse locale. Elle risque de ne pas être joignable par des services externes

source: Open
fr_fr: Ouvrir

source: Feel free to change these parameters in the URL:
fr_fr: Vous pouvez changer librement les paramètres suivants dans l'adresse :

source: language
fr_fr: langue

source: timezone to convert dates
fr_fr: fuseau horaire pour convertir les dates

source: available formats are CSV, JSON, JSONPR and XML
fr_fr: les formats disponibles sont CSV, JSON, JSONPR et XML

source: the maximum count of returned log lines
fr_fr: le nombre maximal de logs voulus

source: the timeout in seconds to return log lines. Increase this value for big counts or when using search
fr_fr: le temps maximal pour retourner les logs. Augmentez cette valeur si vous affichez beaucoup de lignes en retour ou si vous utilisez la recherche

source: search this value in log lines. It can be a regular expression or a regex one
fr_fr: expression à rechercher dans les loges. L'expression peut aussi être une expression régulière

source: this field is optional and is used to specify a callback function when format is JSONP
fr_fr: ce paramètre est optionnel et sert à préciser le nom de la fonction de callback quand vous utilisez le format JSONP

source: Current result
fr_fr: Résultat actuel

source: Refresh
fr_fr: Rafraichir

source: Current password
fr_fr: Mot de passe actuel

source: New password
fr_fr: Nouveau mot de passe

source: New password confirmation
fr_fr: Confirmation du nouveau mot de passe

source: Saving...
fr_fr: Enregistrement...

source: Save
fr_fr: Enregistrer

source: Anonymous access
fr_fr: Accès anonyme

source: History
fr_fr: Historique

source: « Back
fr_fr: « Retour

source: Edit
fr_fr: Modifier

source: Leave password fields blank if you don't want to change it
fr_fr: Laisser les champs de mot de passe vide pour ne pas les changer

source: Select which log files user can view
fr_fr: Sélectionnez les fichiers de logs que l'utilisateur peut voir

source: Cancel
fr_fr: Annuler
