Repository: 123andy/PimpMyLog
Catalog: lang/*/LC_MESSAGES/messages.po
Languages: fr_fr

source: All versions 2.x are supported.
fr_fr: Versions 2.x supportées

source: A flexible & easy-to-manage web server...
fr_fr: Internet Information Services est le logiciel de serveur services Web de la plateforme Windows.

source: NCSA, IIS and W3C log formats are supported
fr_fr: Les logs au format NCSA, IIS et W3C sont supportés

source: The high performance reverse proxy, load balancer, edge cache, origin server
fr_fr: Nginx est un serveur asynchrone

source: Default log formats are supported
fr_fr: Le format de log par défaut est supporté

source: PHP logs defined via the <code>error_log</code> ini parameter.
fr_fr: Logs PHP définis par le paramètre ini <code>error_log</code>.

source: Pimp My Log has detected <code>%s</code> on your server.
fr_fr: Pimp My Log a détecté <code>%s</code> sur le serveur.

source: Pimp My Log has not detected any path in the ini parameter <code>error_log</code>.
fr_fr: Pimp My Log n'a pas détecté de log dans le paramètre ini <code>error_log</code>.

source: Activate this software only if you use <code>ini_set('error_log')</code> directly in your scripts for example.
fr_fr: Activez ce logiciel que si vous utilisez <code>ini_set('error_log')</code> directement dans le code de vos scripts.

source: Setup admin account
fr_fr: Configurer un compte administrateur

source: You can use <em>Pimp my Log</em> without authentication. You will be able to add this feature later from the debugger web interface.
fr_fr: Vous pouvez utiliser <em>Pimp my Log</em> sans authentification. Vous pourrez rajouter cette fonctionnalité plus tard depuis le Debuggeur.

source: Setup an admin account will let you create other users later and give them access to certain log files only.
fr_fr: Configurer un compte d'administrateur vous permettra de créer des utilisateurs et de leur donner accès à certains fichiers de log. Vous pourrez aussi régler un accès anonyme.

source: Do you want to create an admin account now?
fr_fr: Voulez-vous créer un compte admin maintenant ?

source: Create an admin account
fr_fr: Créer un compte administrateur

source: No
fr_fr: Non

source: File <code>%s</code> already exists!
fr_fr: Le fichier <code>%s</code> existe déjà.

source: Please remove it from the root directory:
fr_fr: Supprimez le de la racine :

source: Copy to clipboard
fr_fr: Copier dans le presse-papier

source: Command copied!
fr_fr: Commande copiée !

source: Please choose a username and a password for the admin account.
fr_fr: Choisissez un nom d'utilisateur et un mot de passe pour le compte admin.

source: Username is required
fr_fr: Le nom d'utilisateur est obligatoire

source: Username
fr_fr: Nom d'utilisateur

source: Password must contain at least 6 chars
fr_fr: Le mot de passe doit contenir au moins 6 caractères

source: Password
fr_fr: Mot de passe

source: Password is not the same
fr_fr: Les mots de passe ne correspondent pas

source: Password Confirmation
fr_fr: Confirmation du mot de passe

source: Continue
fr_fr: Continuer

source: Unable to create file <code>%s</code>
fr_fr: Impossible de créer le fichier <code>%s</code>

source: Please give temporary write access to the root directory:
fr_fr: Merci de donner temporairement l'accès en écriture au répertoire racine :

source: Please remove it manually if you want me to create it:
fr_fr: Supprimez le manuellement si vous souhaitez que je le crée :

source: File <code>%s</code> already exists.
fr_fr: Le fichier <code>%s</code> existe déjà.

source: Choose softwares to search log files for
fr_fr: Choisir les logiciels pour lesquels chercher des logs

source: Software <em>%s</em>
fr_fr: Logiciel <em>%s</em>

source: Files <code>%s</code> or <code>%s</code> do not exist. Please review your software configuration.
fr_fr: Les fichiers <code>%s</code> ou <code>%s</code> n'existent pas. Revoyez votre configuration de logiciels.

source: Unable to find any directory.
fr_fr: Impossible de trouver un seul répertoire.

source: Check in the following list if these directories are readable by the webserver user and refresh this page
fr_fr: Vérifiez dans la liste suivante si les répertoires sont lisibles par l'utilisateur qui a lancé le serveur web et rafraichissez la page

source: Directories are available but unable to find files inside.
fr_fr: Les répertoires sont disponibles mais impossible de trouver des fichiers de logs dedans.

source: Check in the following list if these directories contain readable files by the webserver user and refresh this page.
fr_fr: Vérifiez dans la liste suivante si les répertoires contiennent des fichiers de logs lisibles par l'utilisateur qui a lancé le serveur web et rafraichissez la page.

source: Don't forget that to read a file, ALL parent directories have to be accessible too!
fr_fr: N'oubliez pas que pour lire un fichier, TOUS les répertoires parents doivent être traversables !

source: These files have been checked in all paths: %s
fr_fr: Ces fichiers ont été testés dans tous les répertoires : %s

source: Log files have been found!
fr_fr: Des fichiers de log ont été trouvés !

source: Check in the following list which files you want to configure.
fr_fr: Choisissez dans la liste les fichiers que vous souhaitez configurer.

source: If files or directories are missing, verify that they are readable by the webserver user
fr_fr: Si des fichiers ou répertoires sont manquants, vérifiez qu'ils sont bien lisibles par l'utilisateur sous lequel tourne le serveur web.

source: unable to detect web server user
fr_fr: impossible de trouver l'utilisateur sous lequel tourne le serveur web

source: web server user seems to be <code>%s</code>
fr_fr: L'utilisateur sous lequel tourne le serveur web semble être <code>%s</code>

source: You can also type log files path in the text area below separated by coma:
fr_fr: Vous pouvez aussi renseigner le chemin de fichiers de log dans les zones de texte si dessous en les séparant par des virgules :

source: Custom paths
fr_fr: Chemins personnalisés

source: Unknown error
fr_fr: Erreur inconnue

source: Custom files below are not readable, please remove them or verify that they are readable by the webserver user
fr_fr: Les fichiers ci-dessous ne sont pas lisibles. Retirez-les ou vérifiez qu'ils sont bien lisibles par l'utilisateur sous lequel tourne le serveur web

source: File <code>%s</code> does not define function <code>%s</code>. Please review your software configuration.
fr_fr: Le fichier <code>%s</code> ne définit pas la fonction <code>%s</code>. Revoyez votre configuration de logiciels.

source: No configuration found for softwares!
fr_fr: Pas de configuration trouvée pour les logiciels !

source: Unknown action, abort.
fr_fr: Action inconnue, stop.

source: You should take a look on this %spage%s.
fr_fr: Vous devriez jeter un coup d'oeil à %scette page%s.

source: Your PHP installation is not correctly configured to run Pimp My Log.
fr_fr: Votre installation PHP n'est pas correctement configurée pour exécuter Pimp My Log.

source: %s% Complete
fr_fr: %s% complété

source: An error occurs!
fr_fr: Une erreur est survenue !

source: Please wait...
fr_fr: Patientez quelques instants...

source: Software
fr_fr: Logiciel

source: Path
fr_fr: Chemin

source: File
fr_fr: Fichier

source: Readable
fr_fr: Lisable

source: Yes
fr_fr: Oui

source: Name
fr_fr: Nom

source: Notes
fr_fr: Remarques

source: You have to select at least one software to configure!
fr_fr: Vous devez au moins choisir un logiciel à configurer !

source: You have to select at least one log file or type the path of a log file!
fr_fr: Vous devez sélectionner au moins un fichier de log ou sinon renseignez le chemin d'un fichier de log !

source: Configurator
fr_fr: Configurateur

source: Suhosin extension is loaded, according to its configuration, Pimp My Log could not run normally... More information %shere%s.
fr_fr: L'extension Suhosin est chargée et en fonction de son paramétrage, Pimp My Log peut ne pas fonctionner normalement. Plus d'info %sici%s.

source: Reload
fr_fr: Recharger

source: Congratulations!
fr_fr: Félicitations !

source: Your <em>Pimp my Log</em> instance is ready to use.
fr_fr: <em>Pimp my Log</em> est maintenant prêt à être utilisé.

source: You can manually adjust settings in the <code>%s</code> file.
fr_fr: Vous pouvez ajuster les paramètres dans le fichier <code>%s</code>.

source: Please visit <a href="http://pimpmylog.com">pimpmylog.com</a> for more informations.
fr_fr: Visitez <a href="http://pimpmylog.com">pimpmylog.com</a> pour plus d'informations.

source: Pimp my Logs now!
fr_fr: Pimp my Log maintenant !

source: Please refresh the page.
fr_fr: Merci de rafraichir la page.

source: File ID <code>%s</code> does not exist, please review your configuration file and stop playing!
fr_fr: Le fichier d'ID <code>%s</code> n'existe pas. Revoyez votre configuration et arrêtez de jouer :-) !

source: File <code>%s</code> for file ID <code>%s</code> does not exist, please review your configuration file.
fr_fr: Le fichier <code>%s</code> pour le fichier d'ID <code>%s</code> n'existe pas. Revoyez votre configuration.

source: Configuration file has changed and is buggy now. Please refresh the page.
fr_fr: Le fichier de configuration a changé et comporte des erreurs maintenant. Merci de rafraichir la page.

source: Log file has been rotated (previous size was %s and new one is %s)
fr_fr: Le fichier de log a été remplacé (la taille précédente était %s et la nouvelle est %s)

source: File <code>%s</code> for file ID <code>%s</code> does not exist anymore...
fr_fr: Le fichier <code>%s</code> pour le fichier d'ID <code>%s</code> n'existe plus...

source: Unknown error %s
fr_fr: Erreur inconnue %s

source: Log file has been rotated
fr_fr: Le fichier de log a été remplacé.

source: %s in <code>%sms</code> with <code>%s</code> of logs, <code>%s</code> skipped line(s), <code>%s</code> unreadable line(s).<br/>File <code>%s</code> was last modified on <code>%s</code> at <code>%s</code>, size is <code>%s</code>%s
fr_fr: %s en <code>%sms</code> avec <code>%s</code> de logs, <code>%s</code> ligne(s) ignorée(s), <code>%s</code> ligne(s) illisible(s).<br/>Le fichier <code>%s</code> a été modifié le <code>%s</code> (<code>%s</code>), sa taille est <code>%s</code>%s

source: %s new logs found
fr_fr: %s nouveaux logs trouvés

source: no new log found
fr_fr: aucun nouveau log

source: 1 new log found
fr_fr: 1 nouveau log trouvé

source: %s old logs found
fr_fr: %s anciens logs trouvés

source: no old log found
fr_fr: aucun ancien log

source: 1 olg log found
fr_fr: 1 ancien log trouvé

source: log type is <code>%s</code>
fr_fr: le type de log est <code>%s</code>

source: No file is defined in <code>files</code> array
fr_fr: Aucun fichier n'est défini dans le tableau <code>files</code>

source: <code>%s</code> is mandatory for file ID <code>%s</code>
fr_fr: <code>%s</code> est obligatoire pour le fichier d'ID <code>%s</code>

source: B KBMBGBTBPB
fr_fr: o KoMoGoToPo

source: Your username or password is not correct
fr_fr: Le nom d'utilisateur ou le mot de passe n'est pas correct

source: Please try again...
fr_fr: Merci de réessayer...

source: You have been logged out
fr_fr: Vous avez bien été déconnecté

source: You can use %s as the username and %s as the password to test the demo account
fr_fr: Vous pouvez utiliser le nom d'utilisateur %s et le mot de passe %s pour tester le compte de démo

source: Please sign in
fr_fr: Connexion

source: Forgotten your password?
fr_fr: Mot de passe oublié ?

source: Pimp logs for file %s
fr_fr: Pimp logs pour le fichier %s

source: Pimp logs for file %s with search %s
fr_fr: Pimp logs pour le fichier %s avec la recherche %s

source: Feed provided by Pimp My Log
fr_fr: Flux fourni par Pimp my Log

source: <strong>PHP Warning</strong> [%s] %s
fr_fr: <strong>PHP Attention</strong> [%s] %s

source: <strong>PHP Notice</strong> [%s] %s
fr_fr: <strong>PHP Remarque</strong> [%s] %s

source: <strong>PHP Unknown error</strong> [%s] %s
fr_fr: <strong>PHP Erreur inconnue</strong> [%s] %s

source: <strong>PHP Error</strong> line %s: %s
fr_fr: <strong>PHP Error</strong> ligne %s : %s

source: This log file does not exist.
fr_fr: Le fichier de log n'existe pas.

source: Error
fr_fr: Erreur

source: Match is not a valid associative array
fr_fr: Match n'est pas un tableau associatif valide

source: Types is not a valid associative array
fr_fr: Types n'est pas un tableau associatif valide

source: RegEx is not a valid PHP PCRE regular expression
fr_fr: L'expression régulière n'est pas valide avec le standard PHP PCRE

source: Configuration array has been copied to your clipboard!
fr_fr: La configuration a été copiée dans votre presse-papier !

source: This page is protected for security reasons.
fr_fr: Cette page est protégée pour des raisons de sécurité.

source: To grant access, please create this temporary file on your server:
fr_fr: Pour avoir accès à l'outil de debug, vous devez créer ce fichier temporaire sur votre serveur :

source: Then reload this page.
fr_fr: Recharger ensuite la page.

source: Quit
fr_fr: Quitter

source: Regex tester
fr_fr: Testeur d'expression régulière

source: Regex samples
fr_fr: Exemple d'expression régulière

source: Password recovery
fr_fr: Récupération mot de passe

source: Authentication
fr_fr: Authentification

source: Please remove this temporary file on your server to disable the debugger!
fr_fr: Supprimer ce fichier sur votre serveur pour désactiver le debuggeur !

source: RegEx
fr_fr: Expression régulière

source: must be json encoded
fr_fr: doit être encodé en JSON

source: Multiline
fr_fr: Lignes multiples

source: Use CTRL-R shortcut instead of clicking on this button
fr_fr: Utilisez le raccourci CTRL-R au lieu de cliquer sur ce bouton

source: Loading...
fr_fr: Chargement...

source: Generated files with includes (no user logged in or no auth)
fr_fr: Fichier de configuration généré avec les extensions (pas d'utilisateur connecté ou pas d'authentification)

source: Generated files with includes for user %s
fr_fr: Fichier de configuration généré avec les extensions pour l'utilisateur %s

source: Rights
fr_fr: Droits

source: No POSIX functions...
fr_fr: Pas de fonction POSIX...

source: Read
fr_fr: Lire

source: Write
fr_fr: Ecrire

source: Real path
fr_fr: Chemin réel

source: To be optimal, Pimp My Log needs all these modules ok:
fr_fr: Pour fonctionner de manière optimale, Pimp My Log a besoin que ces modules soient installés :

source: Follow instructions %shere%s to enable
fr_fr: Suivez les instructions d'installation %sici%s

source: User %s already exists!
fr_fr: L'utilisateur <code>%s</code> existe déjà.

source: Password confirmation is not the same
fr_fr: La confirmation du mot de passe n'est pas correcte

source: Authentication has been enabled and admin account has been created!
fr_fr: L'authentification a bien été activée et le compte admin a bien été crée !

source: Authentication is currently enabled
fr_fr: L'authentification est activée

source: Please remove this file on your server to disable authentication
fr_fr: Supprimer ce fichier sur votre serveur pour désactiver l'authentification

source: Authentication is currently disabled
fr_fr: L'authentification est desactivée

source: Enable authentication
fr_fr: Activer authentification

source: Please fill an existing username and a new password
fr_fr: Renseignez un nom d'utilisateur existant et un nouveau mot de passe

source: User %s does not exist!
fr_fr: L'utilisateur %s n'existe pas !

source: Password has been updated for user %s!
fr_fr: Le mot de passe de l'utilisateur %s a bien été mis à jour !

source: Reset
fr_fr: Réinitialiser

source: This feature is only available when authentication is enabled.
fr_fr: Cette fonctionnalité n'est disponible que quand l'authentification est activée.

source: GIT is no more availble, please refresh the page
fr_fr: GIT n'est plus disponible, merci de rafraichir la page.

source: Current version %s
fr_fr: Version actuelle %s

source: Unable to check your current version!
fr_fr: Impossible de vérifier votre version actuelle !

source: Messages from the development team
fr_fr: Messages de l'équipe de développement

source: Mark as read
fr_fr: Marquer comme lu

source: Error while fetching URL %s from the server hosting this Pimp my Log instance.
fr_fr: Erreur en essayant de récupérer le contenu de l'adresse %s depuis le serveur qui héberge cette instance de Pimp my Log.

source: Remote version broken!
fr_fr: Version distance cassée !

source: Version %s released on %s
fr_fr: Version %s sortie le %s

source: An upgrade is available !
fr_fr: Une mise à jour est disponible !

source: You have version %s and version %s is available
fr_fr: Vous avez la version %s et la version %s est disponible

source: release notes
fr_fr: Remarques de mise à jour

source: Simply <code>composer update</code> in the installation directory
fr_fr: Faites un <code>composer update</code> dans le répertoire d'installation.

source: Skip this upgrade
fr_fr: Passer cette mise à jour

source: Simply <code>git pull</code> in your directory or follow instructions %shere%s
fr_fr: Faites simplement un <code>git pull</code> dans le répertoire d'installation ou suivez les instructions %sici%s

source: Upgrading...
fr_fr: Mise à jour...

source: Upgrade now
fr_fr: Mettre à jour

source: Your GIT installation cannot be upgraded automatically because of %sthese problems%s.
fr_fr: Votre installation ne pas être automatiquement mise à jour avec GIT à cause de %sces problèmes%s.

source: These files are not writable by the web server user:
fr_fr: Ces fichiers ne sont pas accessible en écriture par l'utilisateur sous lequel tourne le serveur web :

source: The <code>git</code> command is not in the webserver path
fr_fr: La commande <code>git</code> n'est pas disponible pour l'utilisateur sous lequel tourne le serveur web

source: You have modified these files:
fr_fr: Les fichiers suivants ont été modifies :

source: Unknown error, here is the problem output:
fr_fr: Erreur inconnue, voici le retour :

source: Simply <code>git pull</code> in your installation directory.
fr_fr: Faites un <code>git pull</code> dans le répertoire d'installation.

source: Follow instructions %shere%s
fr_fr: Suivez les instructions %sici%s

source: You should upgrade right now:
fr_fr: Vous devriez mettre à jour dès maintenant :

source: Your version %s is out of date
fr_fr: Votre version %s n'est à jour

source: Your version %s is up to date
fr_fr: Votre version %s est à jour

source: Unable to fetch URL %s from the server hosting this Pimp my Log instance.
fr_fr: Impossible de récupérer le contenu de l'adresse %s depuis le serveur qui héberge cette instance de Pimp my Log.

source: Unable to check remote version!
fr_fr: Vérification de la version impossible !

source: Current password is not valid
fr_fr: Le mot de passe actuel n'est pas correct

source: Password has been fakely changed on the demo!
fr_fr: Le mot de passe a bien été changé pour de faux avec le compte demo !

source: Password has been successfully changed!
fr_fr: Le mot de passe a bien été changé !

source: User %s does not exist
fr_fr: L'utilisateur %s n'existe pas

source: User %s already exists
fr_fr: L'utilisateur <code>%s</code> existe déjà

source: Please do not shoot yourself in the foot!
fr_fr: Ne te tire pas une balle dans le pied quand même !

source: <strong>Anonymous access is enabled</strong>. Genuine users have to click on the user menu to sign in and access more logs.
fr_fr: <strong>L'accès anonyme est activé</strong>. Les utilisateurs disposant d'un compte doivent se connecter pour accéder à davantage de logs.

source: <strong>Anonymous access is disabled</strong>. All users have to sign in from the sign in screen.
fr_fr: <strong>L'accès anonyme est desactivé</strong>. Tous les utilisateurs doivent se connecter.

source: Select which log files can be viewed without being logged.
fr_fr: Sélectionnez les fichiers de logs qui peuvent être visualisés sans être connecté.

source: Toggle all log files
fr_fr: Inverser tous les fichiers

source: and an other file defined by glob pattern
fr_fr: an 1 autre fichier possible défini par le glob pattern

source: and %s other possible files defined by glob pattern
fr_fr: et %s autres fichiers possibles définis par le glob pattern

source: Access token
fr_fr: Jeton d'accès

source: Access token copied!
fr_fr: Jeton d'accès copié !

source: Presalt key
fr_fr: Clé de salage

source: Presalt key copied!
fr_fr: Clé de salage copiée !

source: Check to generate both new Access token and new Presalt key
fr_fr: Cochez pour régénérer des nouveaux jeton d'accès et clé de salage

source: Your credentials have not been used
fr_fr: Vos identifiants n'ont pas encore été utilisés

source: API has been called 1 time
fr_fr: L'API a été appelée 1 fois

source: API has been called %s times
fr_fr: L'API a été appelée %s fois

source: Last API call has been done at %s by IP address %s with user agent %s on URL %s
fr_fr: Le dernier appel à l'API a été fait le %s par l'adresse IP %s avec le user agent %s à l'adresse %s

source: PHP version %s is required but your server run %s.
fr_fr: La version %s au minimum de PHP est requise mais votre serveur est en %s.

source: Learn more
fr_fr: Plus d'info

source: Welcome!
fr_fr: Bienvenue !

source: Pimp my Log is not configured.
fr_fr: Pimp my Log n'est pas configuré.

source: You can manually copy <code>cfg/config.example.php</code> to %s in the root directory and change parameters. Then refresh this page.
fr_fr: Vous pouvez copier manuellement le fichier <code>cfg/config.example.php</code> vers %s à la racine et changer les paramètres. Rafraichissez ensuite la page.

source: Or let me try to configure it for you!
fr_fr: Ou sinon, laissez-moi le configurer pour vous !

source: Configure now
fr_fr: Configurer maintenant

source: Your access is disabled, you cannot view any log file.
fr_fr: Votre accès est désactivé, vous n'avez accès à aucun fichier de log

source: Please contact your administrator.
fr_fr: Merci de contacter votre administrateur

source: Sign out
fr_fr: Déconnexion

source: <code>config.user.json</code> configuration file is buggy:
fr_fr: Le fichier de configuration <code>config.user.json</code> comporte des erreurs :

source: If you want me to build the configuration for you, please remove file <code>config.user.json</code> at root and click below.
fr_fr: Si vous voulez que je fasse la configuration, enlevez le fichier <code>config.user.json</code> à la racine et cliquez en dessous s'il vous plait.

source: Add admin
fr_fr: Ajouter un admin

source: Add user
fr_fr: Ajouter un utilisateur

source: All accesses granted
fr_fr: Accès total

source: Anonymous access has been successfully saved!
fr_fr: L'accès anonyme a bien été enregistré !

source: There is no log to display and your are connected... It seems that global parameter <code>AUTH_LOG_FILE_COUNT</code> is set to 0. Change this parameter to a higher value to display logs.
fr_fr: Il n'y a aucun log à afficher et pourtant vous êtes connecté... Il semble que le paramètre global <code>AUTH_LOG_FILE_COUNT</code> est réglé à 0. Réglez ce paramètre à une valeur plus grande pour afficher les lois.

source: Password changed
fr_fr: Mot de passe changé

source: Created by
fr_fr: Crée par

source: Created at
fr_fr: Crée le

source: Delete user
fr_fr: Supprimer

source: 1 log displayed,
fr_fr: 1 log affiché

source: %s logs displayed,
fr_fr: %s logs affichés,

source: Form is invalid:
fr_fr: Le formulaire n'est pas valide :

source: Last login
fr_fr: Dernière connexion

source: Still %s to load
fr_fr: Encore %s à charger

source: Logins
fr_fr: Connexions

source: 1 new log is available
fr_fr: 1 nouveau log disponible

source: New logs are available
fr_fr: Nouveaux logs disponibles

source: %s new logs are available
fr_fr: %s nouveaux logs disponibles
